/* ===== 작업자 (순서 중요) ===== */
const workers = [
  "영훈","갑수","기백","우빈","승호","웅기","학현","범성","성해",
  "응규","영환","상건","재덕","옥연","수신","오채","은우","정훈","용남",
  "성훈","원빈","길운","대현","진솔","준현","서진","이슬","민국","성천","충훈"
];

/* ===== 작업 (순서 중요) ===== */
const tasksData = [
  "LH휀다","LH B필라","L에어백투입","2조1번","LH C필라",
  "SK주유구","멤버어스","LH A필라","마스터백","L도어탈거",
  "낚1","범퍼가이드","2조2번","AS커버","LH 루1","LH 루2",
  "RH 휀다","RH B필라","R에어백투입","RH C필라","R A필라",
  "후드","3조1번","R도어탈거","하이드로닉체결","낚2","엔진어스",
  "3조2번","RH 루1","RH 루2"
];

/* ===== 시작 기준 ===== */
const START_DATE = "2026-01-05";

/* ===== 휴무일 ===== */
const HOLIDAYS = [
  "2026-02-16",
  "2026-02-17",
  "2026-02-18",
  "2026-02-19"
];